INSERT INTO customers (first_name, last_name)
VALUES ('Антон', 'Иванов'),
       ('Николай', 'Иванов'),
       ('Валентин', 'Петров'),
       ('Алексей', 'Сидоров'),
       ('Максим', 'Кузнецов'),
       ('Дмитрий', 'Смирнов'),
       ('Виталий', 'Егоров'),
       ('Григорий', 'Федоров');

INSERT INTO products (name, price)
VALUES ('Минеральная вода', 50.00),
       ('Хлеб', 40.00),
       ('Сметана', 60.00),
       ('Колбаса', 90.00),
       ('Сыр', 120.00),
       ('Молоко', 55.00);

INSERT INTO purchases (customer_id, product_id, purchase_date)
VALUES
-- Покупки Антона Иванова
(1, 1, '2024-08-15'),
(1, 2, '2024-08-16'),
(1, 2, '2024-08-17'),
(1, 3, '2024-08-18'),
(1, 4, '2024-08-19'),
(1, 1, '2024-08-20'),
-- Покупки Николая Иванова
(2, 2, '2024-08-15'),
(2, 4, '2024-08-16'),
(2, 1, '2024-08-17'),
-- Покупки Валентина Петрова
(3, 5, '2024-08-15'),
(3, 2, '2024-08-16'),
(3, 1, '2024-08-17'),
(3, 3, '2024-08-18'),
-- Покупки Алексея Сидорова
(4, 2, '2024-08-15'),
(4, 4, '2024-08-16'),
(4, 6, '2024-08-17'),
-- Покупки Максима Кузнецова
(5, 2, '2024-08-15'),
(5, 4, '2024-08-16'),
(5, 1, '2024-08-17'),
(5, 3, '2024-08-18'),
-- Покупки Дмитрия Смирнова
(6, 1, '2024-08-15'),
(6, 5, '2024-08-16'),
-- Покупки Виталия Егорова
(7, 3, '2024-08-17'),
-- Покупки Григория Федорова
(8, 6, '2024-08-18');


